src/export-files/Documents/СправкаОбОбучении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СправкаОбОбучении</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предоставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДтПд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальностьСтудента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриказОДвиженииКонтингета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидФинансирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсСтудента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписывающийСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПодписывающего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/export-files/InformationRegisters/ДвижениеКонтингента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКонтингента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСтудента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидФинансирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Студенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/export-files/Enums/ВидыПриказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыПриказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восстановление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойКурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводВДругуюГруппу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/export-files/Documents/СправкаОбОбучении/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	ДанныеСтудента = ПолучитьДанныеСтудента(Объект.Студент, Объект.Дата);
	ЗанестиДанныеСтудента(ДанныеСтудента);
КонецПроцедуры

&НаКлиенте
Процедура ЗанестиДанныеСтудента(ДанныеСтудента)
	Если ЗначениеЗаполнено(ДанныеСтудента.ФИО) Тогда
		Объект.ФИОДтПд = ДанныеСтудента.ФИО;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.ДатаРождения) Тогда
		Объект.ДатаРождения = ДанныеСтудента.ДатаРождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Специальность) Тогда
		Объект.СпециальностьСтудента = ДанныеСтудента.Специальность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСтудента.ГодПоступления) Тогда
		Объект.ГодПоступления = ДанныеСтудента.ГодПоступления;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСтудента.ФормаОбучения) Тогда
		Объект.ФормаОбучения = ДанныеСтудента.ФормаОбучения;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСтудента.ВидФинансирования) Тогда
		Объект.ВидФинансирования = ДанныеСтудента.ВидФинансирования;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Курс) Тогда
		Объект.КурсСтудента = ДанныеСтудента.Курс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Группа) Тогда
		Объект.УчебнаяГруппа = ДанныеСтудента.Группа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтудента.Приказ) Тогда
		Объект.Приказ = ПолучитьДокументДвижения(ДанныеСтудента.Приказ.Номер);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументДвижения(НомерДокумента)
	Возврат Документы.ПриказОДвиженииКонтингета.НайтиПоНомеру(НомерДокумента);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтудента(Студент, АктуальнаяДата)
	ДанныеСтудента = Новый Структура;
	ДанныеСтудента.Вставить("ФИО", Студент.Наименование);
	ДанныеСтудента.Вставить("ДатаРождения", Студент.ДатаРождения);
	ДанныеСтудента.Вставить("Специальность", Студент.Специальность);
	ДанныеСтудента.Вставить("ГодПоступления", Студент.ГодПоступления);
	ДанныеСтудента.Вставить("ФормаОбучения", Студент.ТекущаяПрограммаОбучения.ФормаОбучения);
	ДанныеСтудента.Вставить("ВидФинансирования", Студент.ВидФинансирования);
	ДанныеСтудента.Вставить("Курс", Студент.Курс);
	ДанныеСтудента.Вставить("Группа", Студент.УчебнаяГруппа);
	ДанныеСтудента.Вставить("Приказ", ПолучитьПоследнийПриказЗачисления(Студент));
	Возврат ДанныеСтудента;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПоследнийПриказЗачисления(Студент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеКонтингента.Регистратор.Номер КАК НомерПриказа,
		|	ДвижениеКонтингента.Регистратор.Дата КАК ДатаПриказа
		|ИЗ
		|	РегистрСведений.ДвижениеКонтингента КАК ДвижениеКонтингента
		|ГДЕ
		|	ДвижениеКонтингента.Студенты = &Студент
		|	И ДвижениеКонтингента.Регистратор.ВидПриказа = &ВидПриказа
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвижениеКонтингента.Регистратор.Номер,
		|	ДвижениеКонтингента.Регистратор.Дата";
	Запрос.УстановитьПараметр("Студент", Студент);
	Запрос.УстановитьПараметр("ВидПриказа", Перечисления.ВидыПриказов.Зачисление);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Приказ = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Приказ.Вставить("Номер", ВыборкаДетальныеЗаписи.НомерПриказа);
		Приказ.Вставить("Дата", ВыборкаДетальныеЗаписи.ДатаПриказа);
	КонецЦикла;
	Возврат Приказ;
КонецФункции
